Tekla Open API Reference for Tekla Structures 2025
CoordinateSystem.AxisX Property
 The X-axis of the coordinate system.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Vector AxisX { get; set; }
Public Property AxisX As Vector
	Get
	Set
Property Value
Type: Vector
See Also
Reference
CoordinateSystem Class
Tekla.Structures.Geometry3d Namespace